Revit 2027 API
EnergyDataSettings.UseOutsideAirPerPerson Property
Note: This API is now obsolete.
 True if user is specifying outside air per person, false otherwise. Deprecated in Revit 2027 and may be removed in a later version of Revit.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public bool UseOutsideAirPerPerson { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property UseOutsideAirPerPerson As Boolean
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property bool UseOutsideAirPerPerson {
	bool get ();
	void set (bool value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member UseOutsideAirPerPerson : bool with get, set
Property Value
Boolean
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace